[IRI_Melee_Ability X2AbilityTemplate]
LocFriendlyName="Melee"
LocHelpText="Engage an enemy in hand-to-hand combat, with a chance to impair them."
LocLongDescription="Engage an enemy in hand-to-hand combat, with a chance to impair them. Damage increases with soldier's rank."
LocFlyOverText="Hand-to-hand"

[IRI_Punch_Ability X2AbilityTemplate]
LocFriendlyName="Punch"
LocHelpText="Punch an enemy in the head, reducing their Aim."
LocLongDescription="Punch an enemy in the head, reducing their Aim. Damage increases with soldier's rank."
LocFlyOverText="Punch"

[IRI_Kick_Ability X2AbilityTemplate]
LocFriendlyName="Kick"
LocHelpText="Kick an enemy below the waist, reducing their mobility."
LocLongDescription="Kick an enemy below the waist, reducing their mobility. Damage increases with soldier's rank."
LocFlyOverText="Punch"

[IRI_Stockstrike_Ability X2AbilityTemplate]
LocFriendlyName="Stockstrike"
LocHelpText="Strike an enemy with your gun's stock, disorienting them."
LocLongDescription="Strike an enemy with your gun's stock, disorienting them. Damage increases with soldier's rank."
LocFlyOverText="Stockstrike"